---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EllipseYParam
source: html/6d3403fd-b0fc-b5fb-0ed8-b7322cab3251.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EllipseYParam Property

"Y-Radius Value for Ellipse (for Use with XAML Data Template example)"

## Syntax (C#)
```csharp
public static ForgeTypeId EllipseYParam { get; }
```